Revit 2026 API

# SpaceAverageEstimatedIllumination Property

---

Get the Average Estimated Illumination of the Space.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double AverageEstimatedIllumination { get; }
```
```vb
Public ReadOnly Property AverageEstimatedIllumination As Double
	Get
```
```cpp
public:
property double AverageEstimatedIllumination {
	double get ();
}
```
```fsharp
member AverageEstimatedIllumination : float with get
```

#### Property Value

Double

This property is used to get the Average Estimated Illumination of the Space. (Unit: fc)

#### Reference

Space Class

Autodesk.Revit.DB.Mechanical Namespace